Revit 2027 API
BuiltInFailures.RebarFailures.RebarTooShortMetric Property
 The minimum length of rebar shape is 25 mm.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarTooShortMetric { get; }
Public Shared ReadOnly Property RebarTooShortMetric As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarTooShortMetric {
	FailureDefinitionId^ get ();
}
static member RebarTooShortMetric : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace